Ran Apply for project: `github` dir: `apps/github` workspace: `github`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false -no-color \\-\\a\\u\\t\\o\\-\\a\\p\\p\\r\\o\\v\\e" in "/atlantis-data/repos/mvaldes14/terraform/25/github/apps/github": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/elxilote/github/runs/run-z7WzQdVotdwf7fgP

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
github_repository.repo["obs-wiki"]: Refreshing state... [id=obs-wiki]
github_repository.repo["api-go-templ"]: Refreshing state... [id=api-go-templ]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["chef"]: Refreshing state... [id=chef]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["meal-notifier"]: Drift detected (update)
github_repository.repo["twitch-bot"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["obs-wiki"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.dockerhub_token will be created
  + resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "mvaldes14/twitch-bot"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username will be created
  + resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "mvaldes14/twitch-bot"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_chat will be created
  + resource "github_actions_secret" "telegram_chat" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "mvaldes14/ansible_playbooks"
      + secret_name     = "TELEGRAM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_to will be created
  + resource "github_actions_secret" "telegram_to" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "mvaldes14/ansible_playbooks"
      + secret_name     = "TELEGRAM_TO"
      + updated_at      = (known after apply)
    }

  # github_repository.repo["obs-go-cli"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "obs-go-cli"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "homelab",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.

github_actions_secret.telegram_to: Creating...
github_actions_secret.dockerhub_token: Creating...
github_actions_secret.dockerhub_username: Creating...
github_actions_secret.telegram_chat: Creating...
github_repository.repo["obs-go-cli"]: Creating...
github_repository.repo["obs-go-cli"]: Creation complete after 10s [id=obs-go-cli]
╷
│ Error: GET https://api.github.com/repos/mvaldes14/mvaldes14/twitch-bot/actions/secrets/public-key: 404 Not Found []
│
│   with github_actions_secret.dockerhub_username,
│   on main.tf line 16, in resource "github_actions_secret" "dockerhub_username":
│   16: resource "github_actions_secret" "dockerhub_username"{
│
╵
╷
│ Error: GET https://api.github.com/repos/mvaldes14/mvaldes14/ansible_playbooks/actions/secrets/public-key: 404 Not Found []
│
│   with github_actions_secret.telegram_chat,
│   on main.tf line 22, in resource "github_actions_secret" "telegram_chat":
│   22: resource "github_actions_secret" "telegram_chat" {
│
╵
╷
│ Error: GET https://api.github.com/repos/mvaldes14/mvaldes14/twitch-bot/actions/secrets/public-key: 404 Not Found []
│
│   with github_actions_secret.dockerhub_token,
│   on main.tf line 10, in resource "github_actions_secret" "dockerhub_token":
│   10: resource "github_actions_secret" "dockerhub_token"{
│
╵
╷
│ Error: GET https://api.github.com/repos/mvaldes14/mvaldes14/ansible_playbooks/actions/secrets/public-key: 404 Not Found []
│
│   with github_actions_secret.telegram_to,
│   on main.tf line 28, in resource "github_actions_secret" "telegram_to":
│   28: resource "github_actions_secret" "telegram_to" {
│
╵
Operation failed: failed running terraform apply (exit 1)
```
</details>